export default `
[00:00.00] 究竟在想谁的事情呢？
[00:03.10] 心的位置争夺战
[00:05.76] 就戰況而言　一進一退
[00:10.56] 不可以大意
[00:11.70] 其實呀　現在只佔據少數幾％位置
[00:16.73] 在他的心中根本沒有棲身之所
[00:21.38]
[00:21.51] 制服的口袋裡
[00:24.05] 隱藏了真心的話語
[00:26.71] 悄悄地　整理衣領
[00:31.71] 怎麼可能會如此簡單
[00:34.38] 瞭解他緊握著的話語
[00:36.90] 到最後還是只能在遠處觀望的階段
[00:41.81]
[00:42.01] 但是實際上是
[00:44.59] 非常想要看清一切
[00:47.25] 懷著些許期待的內心　不斷鼓動著
[00:51.74] 躲躲藏藏地偷看著
[00:54.97]
[00:56.09] 女孩子最重要的東西（不懷好意地）
[00:58.73] 男孩子最重要的事情（令人生氣）
[01:01.53] 進退兩難的　許多事情
[01:06.26] 其他什麼的就不用多考慮了（勇往直前地）
[01:09.03] 只是一瞬間　卻還不看過來（太遲鈍了）
[01:11.68] 充實感就像滿溢出來似地
[01:16.25] 漸漸滿足了我
[01:17.32] 說出條件吧　再稍微觀察狀況吧
[01:22.50] 彼此都是Win-Win　接受這份交易吧
[01:27.20]
[01:27.33] 就算是魔法少女
[01:29.87] 就算是地底人
[01:32.60] 煩惱的事情也都一樣
[01:37.71] 就算是異星公主
[01:40.13] 就算是幽靈少女
[01:42.71] 大家心跳都撲通撲通地戀愛了
[01:47.99] 喜歡什麼類型之類的
[01:50.51] 想像著最理想
[01:53.21] 的告白時機
[01:55.66] 會是誰的臉龐浮現在腦海中呢？！
[02:01.82] 突然間　力量不斷地湧出（真是不可思議）
[02:04.46] 感人的　溫柔感染著眼眶（為什麼呢）
[02:07.15] 這些全部都是誰的責任呢？
[02:12.04] 身為對手的我是不會認輸的（即使這樣）
[02:14.74] 但是與那傢伙為敵是贏不了的（為什麼呢）
[02:17.47] 那麼樣這是不是有些問題呢？
[02:22.15] 已經來不及了
[02:25.56]
[02:45.74] 女孩子最重要的東西（不懷好意地）
[02:48.20] 男孩子最重要的事情（令人生氣）
[02:51.02] 進退兩難的　許多事情
[02:55.95] 其他什麼的就不用多考慮了（勇往直前地）
[02:58.67] 只是一瞬間　卻還不看過來（太遲鈍了）
[03:01.31] 充實感就像滿溢出來似地
[03:06.01] 漸漸滿足了我
[03:07.02] 說出條件吧　再稍微觀察狀況吧
[03:11.54] 去感受這樣的感覺　接受這份交易吧
[03:17.42] 其實呀　現在只佔據少數幾％位置
[03:22.48] 在他的心中根本沒有棲身之所
[03:27.19]
`;
