export default `
[00:00.00] 谁のことを考えてるの?
[00:03.10] ハートのスペース争夺戦
[00:05.76] 戦况的に 一进一退で
[00:10.56] 油断ならないな
[00:11.70] あのね 今のとこ ほんの数％しか
[00:16.73] アイツの心に 居场所がないんだ
[00:21.38]
[00:21.51] 制服のポケット
[00:24.05] ホンネを忍ばせて
[00:26.71] そっと えりを正す
[00:31.71] そんな简単には
[00:34.38] 手の内 明かせない
[00:36.90] あくまでまだ 様子见の段阶
[00:41.81]
[00:42.01] だけど本当はね
[00:44.59] 见破って欲しいの
[00:47.25] 淡い期待に胸 ときめかして
[00:51.74] チラチラと见てる
[00:54.97]
[00:56.09] オンナノコの大事なモノ(意地悪で)
[00:58.73] オトコノコの大事なコト(ムカつく)
[01:01.53] 引くに引けない それぞれの事情
[01:06.26] ほかに何も考えらんない(真っ直ぐで)
[01:09.03] 一瞬だって よそ见できない(ニブいね)
[01:11.68] 充実感 あふれるほどに
[01:16.25] 満たしてあげるよ
[01:17.32] 条件ちらつかせ 様子うかがって见てる
[01:22.50] お互いWin-Winな トリヒキしようよ
[01:27.20]
[01:27.33] 魔法少女だって
[01:29.87] 地底の民だって
[01:32.60] 悩むとこは同じ
[01:37.71] 异星の姫だって
[01:40.13] オバケの少女だって
[01:42.71] ドキドキして みんな恋をする
[01:47.99] 好きなタイプだとか
[01:50.51] 理想の告白を
[01:53.21] 思い描いた时
[01:55.66] 谁の颜が浮かんできちゃうの?!
[02:01.82] 突然 チカラ涌いてきたり(不思议だよ)
[02:04.46] ホロリ 优しさが染みたり(なぜなの)
[02:07.15] それは全部 谁のせいかな
[02:12.04] ライバルには负けたくない(それなのに)
[02:14.74] だけどアイツには胜てない(なぜなの)
[02:17.47] それってちょっと问题あるけど
[02:22.15] もう手遅れだね
[02:25.56]
[02:45.74] オンナノコの大事なモノ(意地悪で)
[02:48.20] オトコノコの大事なコト(ムカつく)
[02:51.02] 引くに引けない それぞれの事情
[02:55.95] ほかに何も考えらんない(真っ直ぐで)
[02:58.67] 一瞬だって よそ见できない(ニブいね)
[03:01.31] 充実感 あふれるほどに
[03:06.01] 満たしてあげるよ
[03:07.02] 条件ちらつかせ 様子うかがって
[03:11.54] そんな感じの トリヒキしようよ
[03:17.42] あのね今のとこ ほんの数％しか
[03:22.48] アイツの心に 居场所がないんだ
[03:27.19]
`;
